import React from 'react'

import './InfoFront.scss'

function InfoFront() {
    return (
        <div className="infoFront">
            <img src="https://fronthooks.ir/images/frontend-intro.svg" />

            <div className="info">
                <h2>
                    فرانت اند (front-end) چیه ؟
                </h2>
                <p>
                    بذار خیلی خودمونی و به دور از تعاریف کلیشه ای بهت بگم که فرانت اند
                    چیه ؟ کیه و چیکار میکنه ؟ هر وبسایت و یا اپلیکیشنی دو بخش اساسی داره. یکی سمت سرور که کاربر نمیبینه و یکی سمت کاربر که میشه همون ظاهر سایت. دقیقا درست حدس زدی به چیزایی که ما مستقیما باهاش کار میکنیم و میبینم
                    میگن فرانت سایت. مثل هدر، فوتر، بخش اصلی محتوای سایت، فرم های ثبت نام و.. که پیاده کردن همه اینا به عهده توسعه دهنده فرانت (front-end developer) هست. با اومدن فریمورک های جذاب جاوااسکریپت مثل vue.js و کتابخونه ریکت
                    (react.js) وظیفه فرانت خیلی سنگین تر شده و خیلی از کارا که قبلا توسط توسعه دهنده بک اند (back-end developer) انجام میشد، الان دیگه فرانت اند کارا انجام میدن و همین دلیل باعث شده بازار استخدامی فرانت اند خیلی داغ بشه و
                    حقوق فرانت اند هم خیلی بیشتر شده و همه دنبال افراد متخصص توی این حوزه هستند. بهت تبریک میگم به دنیای پر رمز و راز و جذاب
                    برنامه نویسی وب و مخصوصا فرانت، خوش اومدی. از تجربه ما استفاده کن و تا لحظه ورود به بازار کار با نهایت افتخار کنارتیم.
                </p>
            </div>
        </div>
    )
}

export default InfoFront
